In [1]:
import pandas as pd

# making data frame csv at url
data = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")
data.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [2]:

# sum of all salary
val = data['Salary'].sum()
val

2159837111.0

In [3]:
data_2 = {'name': ['John', 'Peter', 'Karl'],
        'age' : [23, 42, 19]}

pd.DataFrame(data_2)

    name  age
0   John   23
1  Peter   42
2   Karl   19

In [4]:
val = pd.DataFrame(data_2)

# Creating a new column
val['total'] = val['age'].sum()
val

    name  age  total
0   John   23     84
1  Peter   42     84
2   Karl   19     84